

GXR = [[

🍃更新日期：1.17
🍃房间刷新修复*2
🍃进程自动选择优化
🍃删除了某项功能

🍃更新日期：1.16
🍃新增脚本文件管理
🍃免费魔法兑换如果出现错误点重试就行
🍃国际服原地跑图自动领取遇境季蜡（如果有）

🍃更新日期：1.15
🍃言出法随修复
🍃免费魔法修复

🍃更新日期：1.14
🍃进程选择优化
🍃国服10.4/国际服20.0版本全功能适配
🍃修复部分情况下出现全功能失效的问题

🍃更新日期：1.12
🍃原地光翼补齐，共112个
🍃由于禁牵功能易闪退，删除功能
🍃国服10.4版本预更新适配完成
🍃国际服20.0版本14号一起更新

🍃更新日期：1.11
🍃跑图结束后的数据计算优化
🍃位置模块优化，新增位置菜单排序
🍃搜索内置瞬移优化，不再限制坐标格式
🍃优化一键季节蜡烛，获取到后自动结束

🍃更新日期：1.10
🍃官网更新3种ADG防封（免费）
🍃官网更新KIT免排队防封一体（免费）

🍃更新日期：1.8
🍃修复云野季蜡获取不全的问题
🍃原地跑配置内新增跑图结束后传送禁阁的开关

🍃更新日期：1.6
🍃搜索功能小优化
🍃娱乐功能新增太空漫步
🍃一键季蜡功能内删除日常任务
🍃新增禁止牵手功能（防强制牵手）
🍃带人模块新增坐标排序改名，优化部分细节

🍃更新日期：1.4
🍃服务器优化提升启动速度，解决部分地区无法打开的问题

🍃更新日期：1.3
🍃霞谷跑道功能内新增完成雪人任务
🍃主页搜索‘圣诞老人’可随地兑换圣诞节先祖物品

🍃更新日期：1.2
🍃重新添加强制牵手，新增禁牵无翼

🍃更新日期：1.1
🍃由于个别玩家内心阴暗，删除强制牵手功能

🍃更新日期：12.31
🍃娱乐模式内新增体型修改功能
🍃修复了使用点亮小黑和强制牵手后魔法无效的问题
🍃原地跑图配置内添加一个切图选择，遇到跑图没蜡烛可以试试

🍃更新日期：12.30
🍃实用功能新增无限放置小船
🍃搜索功能优化，可直接搜索所有先祖节点。
🍃搜索功能优化，可直接搜索星盘好友查身高，送心，送火，拉黑

🍃更新日期：12.29
🍃原地献祭添加启动提示，以免无翼误触

🍃更新日期：12.28
🍃跑图计数优化，自动计算充能合成后的蜡烛数量
🍃带人模块内新增雨林，霞谷地图蜡烛坐标

🍃更新日期：12.27
🍃优化了登陆启动后得多点一次才出来菜单的问题
🍃卡密管理内添加退出登陆与解绑退出
🍃以后设备登陆绑定问题自行处理
🍃原地光翼选项优化
🍃新增可选是否跳过已有光翼以及每次获取光翼数量

🍃更新日期：12.25
🍃提前开启验证以免盗卡
🍃带人/语录模块移动至功能扩展菜单
🍃新增魔法模块，用于搭配并一键使用保存的套装

🍃更新日期：12.24
🍃玩家菜单内全体点亮修复（应该，懒得测）

🍃更新日期：12.23
🍃玩家菜单新增强制牵手
🍃一键拉黑内新增拉黑全部选项
🍃因拉闸崽们的强烈要求，原地光翼改回不跳过已拿翼

🍃更新日期：12.22
🍃原地光翼默认间隔上调
🍃原地光翼改为默认跳过已拿过的翼
🍃下个月开收费，白嫖的xdm可以提前找下家了

🍃更新日期：12.19
🍃一键送心更新优化
🍃一键拉黑更新优化
🍃一键送火速度优化
🍃一键送心移动至日常功能

🍃更新日期：12.18
🍃一键日常速度优化
🍃一键日常配置内新增跑季蜡烛
🍃原地跑图切回47个图
🍃如果原地跑漏火那么调慢跑图速度
🍃现在原地跑内置季蜡必须15个图才能拿全

🍃更新日期：12.17
🍃新增功能配置菜单
🍃一键日常以及原地跑图配置移至功能配置菜单
🍃修复国际服任务卡蜡烛问题
🍃部分功能优化

🍃更新日期：12.16
🍃星盘收火速度优化
🍃星盘收心速度优化
🍃一键日常内加入收爱心功能

🍃更新日期：12.15
🍃删除动作解锁
🍃删除星盘开先祖
🍃删除旧版一键复刻
🍃新增一键兑换免费魔法（日常功能）
🍃秒开动作变更为一键开全复刻（实用功能）
🍃新增获取指定先祖兑换（实用功能）
🍃新增空中画心功能（娱乐功能）：
🍃由于光遇飞行尾迹并非所有人看着相同
🍃所以仅自己可见心形，用于录屏
🍃脚本已适配10.3版本光遇

🍃更新日期：12.13
🍃跑图或一键日常结束后显示获取的烛火

🍃更新日期：12.12
🍃国服新增一键收爱心
🍃国际服献祭修改为无限献祭
🍃双服窥屏聊天修改为单向窥屏
🍃修复了一键日常后七门关闭的问题

🍃更新日期：12.11
🍃原地跑图极限速度优化
🍃跑图默认配置更改为5速
🍃闪耀亮度修复
🍃房间刷新修复

🍃更新日期：12.10
🍃娱乐功能新增跳跃/飞行强化
🍃娱乐功能新增环境色调修改
🍃娱乐功能内新增睡眠状态开关
🍃位置模块内新增晨岛/云野蜡烛坐标
🍃修复了先祖蜡烛卡住的问题
🍃新增睡眠状态开关
🍃新增了部分魔法
🍃魔法归类整理

🍃更新日期：12.9
🍃言出法随修复
🍃窥屏开关修复
🍃ios白耳机修复
🍃语录菜单修复
🍃随身衣柜修复
🍃随身衣柜内置的全衣柜删除
🍃强制发言修复（违禁词和谐）
🍃修复原地跑漏季蜡的问题
🍃日常菜单内新增一键季蜡

🍃更新日期：12.8
🍃国服/国际服常用大多数功能适配完成
🍃新增一键获取所有复刻动作
🍃原地跑默认跑图数修改为15图
🍃修复国际服闪退的问题

🍃更新日期：12.7
🍃自定义菜单BUG修复
🍃实用功能内新增语录/位置模块
🍃语录模块：可自己保存任何文字段落，并单独/批量自动发送
🍃位置模块：可自己保存任何坐标彩蛋，并单独/批量自动传送

🍃更新日期：12.5
🍃国际服友谊菜单修复
🍃国际服好友身高修复
🍃国际服骑小黑修复
🍃友谊菜单优化，启用时切换动作自动应用

🍃更新日期：12.3
🍃点亮小黑优化
🍃被动友谊更新为友谊菜单，新增主动友谊

🍃更新日期：12.1
🍃国际服强制发言修复
🍃删除防止季蜡转白
🍃卡后台功能优化反应速度
🍃玩家菜单新增取消骑乘（之前再点一次就下来了）
🍃国际服不能用脚本的自己更新到光遇最新版本

🍃更新日期：11.30
🍃国际服 0.19.5（206971） 全功能适配

🍃更新日期：11.27
🍃搜索功能的提示文本变更
🍃特殊魔法使用后的提示文本变更
🍃搜索功能与言出法随的使用说明更新
🍃加速菜单内删除3速，新增0.1速，新增自定义变速（修复）

🍃更新日期：11.24
🍃修复国际服窥屏功能
🍃修复国际服言出法随功能
🍃言出法随功能稳定性优化
🍃修复国服卡后台无法恢复的问题
🍃双服新增被动友谊功能（在社交功能菜单里）
🍃新增魔法 <连续大叫> <光之精灵> 可直接搜索输入使用
🍃魔法BUFF <电光火石> 文本变更为 <魔法强化>

🍃更新日期：11.23
🍃修复了玩家菜单内点亮全部小黑异常的问题

🍃更新日期：11.22
🍃删除临时功能：万圣先祖
🍃言出法随中改变天气功能文本变更
🍃修复了使用点亮小黑后大叫会鞠躬的问题

🍃更新日期：11.19
🍃娱乐功能内新增卡后台（这功能技术含量太低了都不想加的，可你们老念叨着还是加了吧）

🍃更新日期：11.18
🍃原地光翼默认调整只拿地图翼
🍃部分功能微调，使用体验优化
🍃防封升级，下载地址：zaoyouzi.cc

🍃更新日期：11.13
🍃新增免费防封下载：zaoyouzi.cc

🍃更新日期：11.12
🍃今天是摆烂的一天，没东西修
🍃脚本有功能问题进群反馈：806867312

🍃更新日期：11.11
🍃修复了特殊情况下一键收心火无法完成的问题

🍃更新日期：11.9
🍃修复新号开图无法完成的问题（11.7-11.8）
🍃修复新号开图功能在禁阁停留的问题
🍃国服新增画质修改功能
🍃国际服适配画质修改功能
🍃修复画质修改无法恢复的问题

🍃更新日期：11.8
🍃言出法随功能优化，新增改变遇境天气的指令

🍃更新日期：11.7
🍃言出法随功能优化(看使用说明)
🍃修复了特殊情况下言出法随内变速/等级报错

🍃更新日期：11.5
🍃搜索功能优化（如果只有一个搜索结果则自动执行）
🍃新增言出法随模式（脚本指令皆在游戏聊天框内执行）
🍃言出法随模式稳定性增强（修复了莫名其妙崩溃的问题）
🍃国服全功能适配10.1（也会导致10.0版本部分功能失效）

🍃更新日期：11.4
🍃原地跑图地图增加到52图
🍃玩家菜单新增距离显示
🍃玩家菜单排版优化，房间刷新修复

🍃更新日期：11.3
🍃开着防转白蜡不要兑换季节爱心，否则吞心
🍃新增一键开启欧若拉向导（一键季节主线）
🍃新增一键开启欧若拉季节先祖（一键常驻先祖）
🍃服务器厂商出毛病了，开梯子可以加速脚本启动
🍃由于瞬移跑图未达到理想效果，因此早柚决定将它删除

🍃更新日期：11.2
🍃场景变速菜单新增临时变速
🍃一键开先祖优化无需搜索数据
🍃一键领取季节爱心优化为无需搜索数据
🍃修复了全图点火无法烧花的问题
🍃修复了一键日常概率出现链接错误的问题
🍃原地跑图默认跑图数从25图变更为47图
🍃有些吊毛说蜡烛少，一分半25图共25蜡烛还不够用么

🍃更新日期：11.1
🍃修复国际服原地献祭
🍃修复国际服一键开神龛
🍃修复国际服一键送心火
🍃修复国际服一键收心火
🍃修复国际服一键送爱心
🍃修复国际服一键拉黑
🍃修复国际服查询好友身高

🍃更新日期：10.31
🍃新增功能一键开神龛
🍃提高自定义菜单返回速度

🍃更新日期：10.30
🍃玩家菜单服饰分辨修复
🍃玩家菜单小黑点亮修复
🍃无障碍发言优化并增加开关
🍃新增防止举报（变小黑）
🍃新增防季蜡转白（启动脚本自动开启）
🍃主页新增万圣节先祖节点兑换（临时功能）

🍃更新日期：10.29
🍃点蜡烛修复
🍃吸蜡烛修复
🍃原地献祭修复
🍃骑小黑功能修复
🍃修复无翼无法恢复
🍃玩家菜单身高查询修复
🍃玩家菜单坐标瞬移修复
🍃随身衣柜修复优化
🍃新增临时全动作解锁
🍃新增一大堆奇怪的魔法

🍃更新日期：10.28
🍃小黑互动修复
🍃动作升级修复
🍃文件储存优化
🍃自定义菜单文件优化

🍃更新日期：10.27
🍃搜索功能已支持搜索魔法
🍃国际服19.1版本适配
🍃一键开常驻先祖修复
🍃魔法功能新增猫猫套装魔法

🍃更新日期：10.25
🍃国服光遇0.10.0已全功能适配

🍃更新日期：10.24
🍃修复循环炸翼无法结束的问题
🍃修复光翼修改数值固定的问题

🍃更新日期：10.23
🍃国服开七门功能优化
🍃主菜单搜索功能已支持搜索地图传送
🍃修复送爱心的功能(没想到这玩意真有人用)
🍃新增45个未知魔法(为什么是未知？因为懒得去看)

🍃更新日期：10.21
🍃添加ios白耳机功能(所有人可见)

🍃更新日期：10.19
🍃双服新增原地先祖蜡烛
🍃修复国服原地献祭封号问题
🍃修复无法白嫖季节心的问题
🍃修复窥屏功能闪退

🍃更新日期：10.18
🍃国际服大多数常用功能适配

🍃更新日期：10.15
🍃新增任务修复功能
🍃新增无视风墙功能
🍃修复窗口窥屏，合并窥屏聊天
🍃修复原地跑图不领取遇境季蜡的问题

🍃更新日期：10.13
🍃修复了切号后原地跑加速无效
🍃修复的一键任务概率变成负数
🍃社交功能内新增无障碍聊天

🍃更新日期：10.12
🍃新增瞬移跑图
🍃瞬移跑图可保存跑图进度
🍃菜单布局优化
🍃新增一键日常功能
]]

gg.alert(GXR)